# HalfAngle Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ConicalSurface..::..HalfAngle Property
ConicalSurface Class See Also
---
Cone angle.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public double HalfAngle { get; }
```

Visual Basic
---
```text
Public ReadOnly Property HalfAngle As Double
	Get
```

Visual C++
---
```text
public:
property double HalfAngle {
	double get ();
}
```

# See Also
ConicalSurface Class
Autodesk.Revit.DB Namespace